"""
https://m.blog.naver.com/PostView.naver?isHttpsRedirect=true&blogId=somienglish&logNo=221108213964
무슨 메일을 쓰면 좋을까?
일단 양이 많아야 할 듯..

제목: [경기북과학고등학교] 논문 자문위원 문의
[말머리] "논문 제목" 논문 자문위원을 요청드립니다
1. 시작문장
경기북과혹고등학교 1학년생 공현성, 황재원, 한승민입니다.

1-1. 자문위원요청
연구를 위해 자문위원의 섭외를 하려고 합니다.
논문의 자문위원을 부탁드리고 싶습니다.

저희는 뉴스를 통하여 주가를 예측하는 연구에 관한 논문을 작성하고자 합니다.

2. 어떻게 이 논문을 보게되었는지
연구를 하기 위해 여러 논문을 DBpia에 검색하던 도중 저희의 연구와 방향이 비슷한 논문을 보게 되었고

3-5. 어떻게 이메일 주소를 알게되었는지
논문과 관련해서 여러 궁금한 점이 생겨 논문의 마지막 부분에 적혀있었던 이메일을 통해 이렇게 연락드리게 되었습니다.

4. 이메일을 작성하는 이유
- 논문 소감

- 논문요약
이미 존재하는 모델들에 관심도 지표와 다른 경제지표들을 추가하여 새로운 모델을 구성하였다.
관심도 지표에 사용되는 비정형 데이터들은 특징을 선별하고 분류하여 이용하였다.
결과적으로 관심도 지표는 주가예측에 도움이 됬다.

- 연구 목적
뉴스를 통하여 주가를 예측할 때의 장점을 살리고자 투기성 시장에서의 주가를 예측하려고 합니다.
모델은 시계열 분석의 형식으로 진행하려고 합니다.

저희의 연구는 궁극적으론 주가 예측을 목적으로 하며 오피니언 마이닝을 통해 뉴스 내용을 분석하여 긍정 부정 태깅을
통한 데이터 실제 주식 데이터를 비교해서 실질적으로 뉴스와 주식의 관련성을 분석하는 것이 주 목적입니다.

- 질문할 내용들 (한 7개는 해야하지 않을까라는 생각이 들어요)
1. 논문에서 뉴스들의 중심단어들을 이용해서 그 단어들을 성려 벡터로 표현하셨는데, 단어를 벡터로 표현하는 방법을 여쭤보고 싶습니다.(어떤 프로그램을 썼는지 등의 실질적인 방법)
2. 단어를 벡터로 표현하지 않고 그 시간에 따른 뉴스에 나오는 단어 자체와 주식 데이터를 머신러닝 모델의 데이터로 사용해서 주식 예측 모델을 만들경우 생길 수 있는 문제점 OR 이런 방식을 사용하였을 경우 정확도가 높을지
3. 뉴스 단어 데이터와 주식 데이터를 한 개의 모델에게 준비 데이터로 넣어 줄 때, 두가지 데이터를 모델에 넣는 방법에 대해서 여쭤보고 싶습니다
4. 이런 종류의 머신러닝 모델을 만들때는, 어떤 형태의 모델로 만드는 것이 적합한가요?
5. 뉴스 단어 데이터는 주식에 대해 즉각적 혹은 몇일 뒤에 영향을 주지만 주식 데이터는 시간에 상관없이 주식 그래프의 경향성에 영향을 준다고 조사를 하였습니다. 이러한 시간적 작용점이 다른 두 데이터를 한 번에 처리하기 위해서는 어떻게 해야되나요?
6.모델 구성한 위한 뉴스 및 주가 데이터들은 어디서 구한 데이터들을 이용하셨나요?
7.긍정도를 분석할때 요소들을 단어 단위로 끊었을때 두 단어가 같이있어야 의미가 있는 것에는 문제가  있었을것 같은데 그런 요소들은 어떻게 처리하셨나요? ex) 맛있음과는 거리가 멀었다.


볻킵

그 밖에 조언할

5. 메일 끝내기








"""
